In [7]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [8]:
dataset = pd.read_csv("Financial-Sample.csv")
dataset.sample(4)

,Segment,Country,Product,DiscountBand,Units,Manufacturing,SalePrice,Gross Sales,Discounts,Sales,COGS,Profit,Date,Month Number,Month Name,Year
38,Small Business,Canada,VTT,NaN,"$ 2,001.00",$ 250.00,NaN,"$ 600,300.00",0,"$ 600,300.00","$ 500,250.00","$ 100,050.00",2/1/2014,2,February,2014
433,Channel Partners,France,VTT,Medium,"$ 2,234.00",$ 250.00,$ 12.00,"$ 26,808.00","$ 2,412.72","$ 24,395.28","$ 6,702.00","$ 17,693.28",9/1/2013,9,September,2013
339,Small Business,Canada,Paseo,Medium,"$ 1,404.00",$ 10.00,$ 300.00,"$ 421,200.00","$ 29,484.00","$ 391,716.00","$ 351,000.00","$ 40,716.00",11/1/2013,11,November,2013
610,Channel Partners,Mexico,Amarilla,High,$ 410.00,$ 260.00,$ 12.00,"$ 4,920.00",$ 639.60,"$ 4,280.40","$ 1,230.00","$ 3,050.40",10/1/2014,10,October,2014

In [4]:
dataset.isnull().sum()

Segment           0
Country           0
Product           0
DiscountBand     53
Units            30
Manufacturing    16
SalePrice        11
Gross Sales      22
Discounts         9
Sales            20
COGS             11
Profit           16
Date              0
Month Number      0
Month Name        0
Year              0
dtype: int64

In [5]:
dataset["Units"].fillna(dataset["Units"].mode()[0],inplace=True)

C:\Users\JAYANT SINGH PATEL\AppData\Local\Temp\ipykernel_26652\3211804459.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataset["Units"].fillna(dataset["Units"].mode()[0],inplace=True)

In [6]:
dataset.isnull().sum()

Segment           0
Country           0
Product           0
DiscountBand     53
Units             0
Manufacturing    16
SalePrice        11
Gross Sales      22
Discounts         9
Sales            20
COGS             11
Profit           16
Date              0
Month Number      0
Month Name        0
Year              0
dtype: int64

In [79]:
# dataset = dataset.ffill(axis=0)
# dataset

In [80]:
dataset["Units"].mode()[0]

' $ 727.00 '

In [84]:
 dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 16 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Segment        700 non-null    object
 1   Country        700 non-null    object
 2   Product        700 non-null    object
 3   DiscountBand   700 non-null    object
 4   Units          700 non-null    object
 5   Manufacturing  700 non-null    object
 6   SalePrice      700 non-null    object
 7   Gross Sales    700 non-null    object
 8   Discounts      700 non-null    object
 9   Sales          700 non-null    object
 10  COGS           700 non-null    object
 11  Profit         700 non-null    object
 12  Date           700 non-null    object
 13  Month Number   700 non-null    int64
 14  Month Name     700 non-null    object
 15  Year           700 non-null    int64
dtypes: int64(2), object(14)
memory usage: 87.6+ KB

NameError: name 'dataset' is not defined